In [2]:
import pandas as pd
import numpy as np
import math
import matplotlib as plt
import pdpipe as pdp

In [3]:
name = "dataset_8"

original_df8 = pd.read_csv(name+".csv")
df8 = original_df8
df8.head()

,nta_name,borough,nta_code,population,under_5_years,5-9_years,10-14_years,15-19_years,20-24_years,25-29_years,...,15000_to_24999,25000_to_34999,35000_to_49999,50000_to_74999,75000_to_99999,100000_to_149999,150000_to_199999,200000_or_more,median_income,mean_income
0,Bath Beach,Brooklyn,BK27,33163,2210,1826,1922,1657,1726,2850,...,1223,927,1290,2074,1352,1758,706,585,58243,75950
1,Bay Ridge,Brooklyn,BK31,79134,5166,4513,3379,3551,4347,6827,...,3235,3047,3542,5570,4108,4827,2497,2775,63539,86319
2,Bedf8ord,Brooklyn,BK75,75318,7480,6580,5378,4635,6479,8683,...,3385,2509,3124,3706,2269,2847,1195,1034,39970,62616
3,Bensonhurst East,Brooklyn,BK29,64267,4151,3563,2891,3470,4182,4939,...,2718,2185,2655,3898,2558,2416,1144,844,48097,65715
4,Bensonhurst West,Brooklyn,BK28,91646,6498,5162,4529,4648,5793,8036,...,3383,3246,4036,5117,3428,3743,1649,1231,51035,70198

In [19]:
df8.set_index("nta_code")

pipe = pdp.ColDrop("nta_name")
pipe += pdp.RowDrop({"borough": lambda b : b in ["Staten Island","Queens"]})

'''
all nta boroughs (guess): ['Brooklyn', 'Queens', 'Manhattan', 'Bronx', 'Staten Island']
'''
df8 = pipe(df8)
df8.head()

,borough,nta_code,population,under_5_years,5-9_years,10-14_years,15-19_years,20-24_years,25-29_years,30-34_years,...,15000_to_24999,25000_to_34999,35000_to_49999,50000_to_74999,75000_to_99999,100000_to_149999,150000_to_199999,200000_or_more,median_income,mean_income
0,Brooklyn,BK27,33163,2210,1826,1922,1657,1726,2850,2771,...,1223,927,1290,2074,1352,1758,706,585,58243,75950
1,Brooklyn,BK31,79134,5166,4513,3379,3551,4347,6827,6876,...,3235,3047,3542,5570,4108,4827,2497,2775,63539,86319
2,Brooklyn,BK75,75318,7480,6580,5378,4635,6479,8683,6984,...,3385,2509,3124,3706,2269,2847,1195,1034,39970,62616
3,Brooklyn,BK29,64267,4151,3563,2891,3470,4182,4939,4634,...,2718,2185,2655,3898,2558,2416,1144,844,48097,65715
4,Brooklyn,BK28,91646,6498,5162,4529,4648,5793,8036,7766,...,3383,3246,4036,5117,3428,3743,1649,1231,51035,70198

In [20]:
'''
nta_full = pd.read_csv("nynta.csv")
nta_full.head()
nta_full.BoroName.unique()
'''

,BoroCode,BoroName,the_geom,CountyFIPS,NTACode,NTAName,Shape_Leng,Shape_Area
0,3,Brooklyn,MULTIPOLYGON (((-73.97604935657381 40.63127590...,47,BK88,Borough Park,39247.227831,5.400502e+07
1,4,Queens,MULTIPOLYGON (((-73.80379022888098 40.77561011...,81,QN51,Murray Hill,33266.904797,5.248828e+07
2,4,Queens,MULTIPOLYGON (((-73.8610972440186 40.763664477...,81,QN27,East Elmhurst,19816.712074,1.972685e+07
3,4,Queens,MULTIPOLYGON (((-73.75725671509139 40.71813860...,81,QN07,Hollis,20976.335574,2.288777e+07
4,1,Manhattan,MULTIPOLYGON (((-73.94607828674226 40.82126321...,61,MN06,Manhattanville,17040.685413,1.064708e+07

In [21]:
nta_full.BoroName.unique()

array(['Brooklyn', 'Queens', 'Manhattan', 'Bronx', 'Staten Island'],
      dtype=object)